nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_scan.c
/******************************************************************************

 @file  mac_scan.c

 @brief This module implements procedures required for scan.

 Group: WCS, LPC
 Target Device: cc13xx_cc26xx

 ******************************************************************************
 
 Copyright (c) 2005-2021, Texas Instruments Incorporated
 All rights reserved.

 IMPORTANT: Your use of this Software is limited to those specific rights
 granted under the terms of a software license agreement between the user
 who downloaded the software, his/her employer (which must be your employer)
 and Texas Instruments Incorporated (the "License"). You may not use this
 Software unless you agree to abide by the terms of the License. The License
 limits your use, and you acknowledge, that the Software may not be modified,
 copied or distributed unless embedded on a Texas Instruments microcontroller
 or used solely and exclusively in conjunction with a Texas Instruments radio
 frequency transceiver, which is integrated into your product. Other than for
 the foregoing purpose, you may not use, reproduce, copy, prepare derivative
 works of, modify, distribute, perform, display or sell this Software and/or
 its documentation for any purpose.

 YOU FURTHER ACKNOWLEDGE AND AGREE THAT THE SOFTWARE AND DOCUMENTATION ARE
 PROVIDED "AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED,
 INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE,
 NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL
 TEXAS INSTRUMENTS OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER CONTRACT,
 NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR OTHER
 LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
 INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE
 OR CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT
 OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
 (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.

 Should you have any questions regarding your right to use this Software,
 contact Texas Instruments Incorporated at www.TI.com.

 ******************************************************************************
 
 
 *****************************************************************************/
#ifndef LIBRARY
#include "ti_wisunfan_features.h"
#endif

#if defined (FEATURE_BEACON_MODE) || defined (FEATURE_NON_BEACON_MODE)
/* ------------------------------------------------------------------------------------------------
 *                                          Includes
 * ------------------------------------------------------------------------------------------------
 */
#include "timac_api.h"
#include "mac_spec.h"
#include "mac_main.h"
#include "mac_timer.h"
#include "mac_mgmt.h"
#include "mac_pib.h"
#include "mac_security_pib.h"
#include "mac_data.h"
#include "mac_scan.h"
#include "mac_low_level.h"

// SW Tracer
#include "dbg.h"
#ifdef DEBUG_SW_TRACE
#define DBG_ENABLE
#ifndef _DBGFILE
#define _DBGFILE mac_scan_c
#endif
#include "dbgid_sys_mst.h"
//#include "dbgid_sys_slv.h"
#endif // DEBUG_SW_TRACE

/******************************************************************************
  ROM jump table will support
  1. TIMAC ROM image build
  2. TIMAC stack build without ROM image
  3. TIMAC stack with calling ROM image
 *****************************************************************************/
#include "rom_jt_154.h"

/* ------------------------------------------------------------------------------------------------
 *                                           Constants
 * ------------------------------------------------------------------------------------------------
 */

/* Maximum scan duration */
#define MAC_SCAN_DURATION_MAX           14

/* Value to determine last channel for end of scan */
#define MAC_SCAN_CHAN_END               (MAC_CHAN_HIGHEST + 1)

/* Value indicating scanning has not started */
#define MAC_SCAN_CHAN_INIT              (MAC_SCAN_CHAN_END + 1)

/* ------------------------------------------------------------------------------------------------
 *                                           Global Variables
 * ------------------------------------------------------------------------------------------------
 */


/* ------------------------------------------------------------------------------------------------
 *                                           Local Functions
 * ------------------------------------------------------------------------------------------------
 */

void macScanCnfInit(macMlmeScanCnf_t *pScanCnf, macEvent_t *pEvent);

/**************************************************************************************************
 * @fn          macScanCnfInit
 *
 * @brief       This function initializes a scan confirm data structure from data in the api
 *              scan request event.
 *
 * input parameters
 *
 * @param       pScanCnf - Pointer to scan confirm data.
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
void macScanCnfInit(macMlmeScanCnf_t *pScanCnf, macEvent_t *pEvent)
{
  pScanCnf->hdr.event = MAC_MLME_SCAN_CNF;
  pScanCnf->scanType = pEvent->api.mac.scanReq.scanType;
  pScanCnf->channelPage = pEvent->api.mac.scanReq.channelPage;
  pScanCnf->phyID = pEvent->api.mac.scanReq.phyID;
  MAP_osal_memcpy(pScanCnf->unscannedChannels, pEvent->api.mac.scanReq.scanChannels, MAC_154G_CHANNEL_BITMAP_SIZ);
  if (pScanCnf->scanType == MAC_SCAN_ED)
  {
    /* For energy scan, set the result list size to the allocated size of the list*/
    pScanCnf->resultListSize = APIMAC_154G_MAX_NUM_CHANNEL;
  }
  else
  {
    pScanCnf->resultListSize = 0;
  }
  pScanCnf->result.pEnergyDetect = pEvent->api.mac.scanReq.result.pEnergyDetect;
}

/**************************************************************************************************
 * @fn          macApiScanReq
 *
 * @brief       This function handles an API scan request event.  It first copies the API
 *              parameters to the macScan structure.  Then it verifies the parameters.  If
 *              the parameters are out of range it sets macScan.scanCnf.hdr.status to
 *              MAC_INVALID_PARAMETER and calls macExecute() to send a MAC_INT_SCAN_COMPLETE
 *              to the MAC.  If parameters are ok it then calls macRadioStartScan() to initialize
 *              the receiver for scanning.  Then it calls macExecute() to send a MAC_INT_TIM_SCAN_EVT
 *              to the MAC.  This sets the first channel and starts the scan.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macApiScanReq(macEvent_t *pEvent)
{
#ifdef COMBO_MAC
    uint8 rfFreq = pMacPib->rfFreq;
#endif
  macScan.scanCnf.hdr.status = MAC_SUCCESS;

  /* check api parameters */
  MAC_PARAM_STATUS(pEvent->api.mac.scanReq.scanType <= MAC_SCAN_ACTIVE_ENHANCED,
                   macScan.scanCnf.hdr.status);
  MAC_PARAM_STATUS((pEvent->api.mac.scanReq.scanDuration <= MAC_SCAN_DURATION_MAX) ||
                   (pEvent->api.mac.scanReq.scanType == MAC_SCAN_ORPHAN),
                   macScan.scanCnf.hdr.status);
  MAC_PARAM_STATUS((pEvent->api.mac.scanReq.scanType != MAC_SCAN_ORPHAN) ||
                   (macMain.featureMask & MAC_FEAT_DEVICE_MASK),
                   macScan.scanCnf.hdr.status);
#ifdef FEATURE_ENHANCED_BEACON
  MAC_PARAM_STATUS( (FALSE == pEvent->api.mac.scanReq.MPMScan) ||
                    ((TRUE == pEvent->api.mac.scanReq.MPMScan) &&
                     ((MAC_MPM_SCAN_BPAN == pEvent->api.mac.scanReq.MPMScanType) ||
                      (MAC_MPM_SCAN_NBPAN == pEvent->api.mac.scanReq.MPMScanType))),
                    macScan.scanCnf.hdr.status );

  MAC_PARAM_STATUS( (FALSE == pEvent->api.mac.scanReq.MPMScan) ||
                    ((TRUE == pEvent->api.mac.scanReq.MPMScan) &&
                     ((MAC_MPM_SCAN_BPAN == pEvent->api.mac.scanReq.MPMScanType) &&
                      (pEvent->api.mac.scanReq.MPMScanDuration <= 14))||
                      ((MAC_MPM_SCAN_NBPAN == pEvent->api.mac.scanReq.MPMScanType) &&
                       (pEvent->api.mac.scanReq.MPMScanDuration > 0) &&
                       (pEvent->api.mac.scanReq.MPMScanDuration <= 16383))),
                    macScan.scanCnf.hdr.status );

  MAC_PARAM_STATUS( (MAC_MPM_SCAN_BPAN != pEvent->api.mac.scanReq.MPMScanType) ||
                    (MAC_MPM_SCAN_BPAN == pEvent->api.mac.scanReq.MPMScanType) &&
                    (pEvent->api.mac.scanReq.scanType == MAC_SCAN_PASSIVE) &&
                    (TRUE == pEvent->api.mac.scanReq.MPMScan),
                    macScan.scanCnf.hdr.status);
#else
 MAC_PARAM_STATUS( (FALSE == pEvent->api.mac.scanReq.MPMScan),
                   macScan.scanCnf.hdr.status);
#endif /* FEATURE_ENHANCED_BEACON */

