nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_scan.c
  /* verify channel page */
#ifdef COMBO_MAC
  if (rfFreq == MAC_RF_FREQ_SUBG)
  {
      MAC_PARAM_STATUS((pEvent->api.mac.scanReq.channelPage >= MAC_CHANNEL_PAGE_9) &&
                       (pEvent->api.mac.scanReq.channelPage <= MAC_CHANNEL_PAGE_10),
                       macScan.scanCnf.hdr.status);

      /* verify phy ID */
      MAC_PARAM_STATUS(((pEvent->api.mac.scanReq.phyID >= MAC_MRFSK_STD_PHY_ID_BEGIN) &&
                       (pEvent->api.mac.scanReq.phyID <= MAC_MRFSK_STD_PHY_ID_END)) ||
                       ((pEvent->api.mac.scanReq.phyID >= MAC_MRFSK_GENERIC_PHY_ID_BEGIN) &&
                       (pEvent->api.mac.scanReq.phyID <= MAC_MRFSK_GENERIC_PHY_ID_END)),
                       macScan.scanCnf.hdr.status);
  }
#else
#ifndef FREQ_2_4G
  MAC_PARAM_STATUS((pEvent->api.mac.scanReq.channelPage >= MAC_CHANNEL_PAGE_9) &&
                   (pEvent->api.mac.scanReq.channelPage <= MAC_CHANNEL_PAGE_10),
                   macScan.scanCnf.hdr.status);

  /* verify phy ID */
  MAC_PARAM_STATUS(((pEvent->api.mac.scanReq.phyID >= MAC_MRFSK_STD_PHY_ID_BEGIN) &&
                   (pEvent->api.mac.scanReq.phyID <= MAC_MRFSK_STD_PHY_ID_END)) ||
                   ((pEvent->api.mac.scanReq.phyID >= MAC_MRFSK_GENERIC_PHY_ID_BEGIN) &&
                   (pEvent->api.mac.scanReq.phyID <= MAC_MRFSK_GENERIC_PHY_ID_END)),
                   macScan.scanCnf.hdr.status);
#endif
#endif

  /* store and initialize scan parameters */
  MAP_macScanCnfInit(&macScan.scanCnf, pEvent);
  MAP_osal_memcpy(macScan.scanChannels, pEvent->api.mac.scanReq.scanChannels,
         MAC_154G_CHANNEL_BITMAP_SIZ );

  /* if it is MPM Scan use the value for scan duration from MPMScanDuration */
  if (pEvent->api.mac.scanReq.MPMScan)
  {
    macScan.MPMScanType = pEvent->api.mac.scanReq.MPMScanType;
    macScan.scanDuration = pEvent->api.mac.scanReq.MPMScanDuration;
  }
  else
  {
    /* Initialize MPM Scan type to 0, indicating not a MPM scan */
    macScan.MPMScanType = 0;
    macScan.scanDuration = pEvent->api.mac.scanReq.scanDuration;
  }

  macScan.maxResults = pEvent->api.mac.scanReq.maxResults;
  macScan.permitJoining = pEvent->api.mac.scanReq.permitJoining;
  macScan.linkQuality = pEvent->api.mac.scanReq.linkQuality;
  macScan.percentFilter = pEvent->api.mac.scanReq.percentFilter;
  macScan.currentChannel = MAC_SCAN_CHAN_INIT;
  macScan.origChannel = pMacPib->logicalChannel;
  macScan.origChPage = pMacPib->channelPage;
  macScan.origPhyId = pMacPib->curPhyID;
  macScan.scanTimer.pFunc = MAP_macSetEvent;
  macScan.scanTimer.parameter = MAC_SCAN_TASK_EVT;

  /* copy scan request security settings */
  MAP_osal_memcpy(&macScan.sec, &pEvent->api.mac.scanReq.sec, sizeof(ApiMac_sec_t));

  if ((macScan.scanCnf.hdr.status == MAC_SUCCESS) && (pEvent->hdr.status == MAC_SUCCESS))
  {
    /* initialize the phy ID to the requested phy ID */
    uint8 phyId = pEvent->api.mac.scanReq.phyID;

    /* initialize status */
    if (macScan.scanCnf.scanType != MAC_SCAN_ED)
    {
      macScan.scanCnf.hdr.status = MAC_NO_BEACON;
    }

    /* Set the requested channel Page */
    MAP_MAC_MlmeSetReq(MAC_CHANNEL_PAGE, &(pEvent->api.mac.scanReq.channelPage));

    /* For MPM Scan, set the PHY corresponding to the CSM mode */
    if ( macScan.MPMScanType )
    {
      phyId = MAP_macGetCSMPhy(pEvent->api.mac.scanReq.phyID);
    }

    if ( phyId != pMacPib->curPhyID )
    {
      /* Set the requested/csm Phy ID */
      MAP_MAC_MlmeSetReq(MAC_PHY_CURRENT_DESCRIPTOR_ID, &phyId);
    }

    /* initialize radio for scanning */
    MAP_macRadioStartScan(macScan.scanCnf.scanType);

    pEvent->hdr.event = MAC_TIM_SCAN_EVT;

    /* indicates RX needs to be kept on */
    MAP_macRxSoftEnable(MAC_RX_SCAN);
  }
  else
  {
    pEvent->hdr.event = MAC_INT_SCAN_COMPLETE_EVT;
  }

  MAP_macExecute(pEvent);
}

#if !defined(TIMAC_ROM_PATCH)
/**************************************************************************************************
 * @fn          macScanNextChan
 *
 * @brief       This function sets up for the next channel to be scanned.  It determines the next
 *              channel based on the current channel and the requested scan channels.  If this is
 *              an energy detect or passive scan, it calls macScanStartTimer() to start the scan
 *              timer immediately.  If this is an active or orphan scan, it calls
 *              macBuildCommonReq() to build and send a beacon request command frame or orphan
 *              notification command frame. If there are no more channels to be scanned (or) if
 *              there are any security failures update the scanCnf status, then the function
 *              calls macExecute() to send a MAC_INT_SCAN_COMPLETE_EVT to the MAC.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macScanNextChan(macEvent_t *pEvent)
{
  uint8   cmd;
  sAddr_t dstAddr;
  uint8   srcAddrMode;
#ifdef FEATURE_ENHANCED_BEACON
  macTx_t *pMsg;
  uint8   requestField = 0;
#endif /* FEATURE_ENHANCED_BEACON */
  uint8   status;
  uint8   tempScanMap;

  DBG_PRINT0(DBGSYS, "macScaNextChan");

  /* if energy detect scan store value from previous channel scanned */
  if ((macScan.scanCnf.scanType == MAC_SCAN_ED) &&
      (macScan.currentChannel != MAC_SCAN_CHAN_INIT))
  {
    /* we used maxResults element to temporarily store value */
    macScan.scanCnf.result.pEnergyDetect[macScan.currentChannel - MAC_CHAN_LOWEST]
      = MAP_macRadioEnergyDetectStop();
  }

  /* initialize current channel */
  if (macScan.currentChannel == MAC_SCAN_CHAN_INIT)
  {
    macScan.currentChannel = MAC_CHAN_LOWEST;
  }
  else
  {
    macScan.currentChannel++;
  }

  /* get next channel */
  do
  {
    tempScanMap = macScan.scanChannels[(macScan.currentChannel - MAC_CHAN_LOWEST) / 8];
    macScan.scanChannels[(macScan.currentChannel - MAC_CHAN_LOWEST) / 8] >>= 1;
    if ((tempScanMap & 0x01) == 0x01)
    {
      break;
    }
  } while (++(macScan.currentChannel) < MAC_SCAN_CHAN_END);

