nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_scan.c
  DBG_PRINT1(DBGSYS, "Scan CurrCh= 0x%X", macScan.currentChannel);

  /* if not done */
  if (macScan.currentChannel < MAC_SCAN_CHAN_END)
  {
    /* set channel */
    MAP_MAC_MlmeSetReq(MAC_LOGICAL_CHANNEL, &macScan.currentChannel);

    /* destAddr for orphan, active scan, and enhanced active scan */
    dstAddr.addrMode = SADDR_MODE_SHORT;
    dstAddr.addr.shortAddr = MAC_SHORT_ADDR_BROADCAST;
    if ((macScan.scanCnf.scanType == MAC_SCAN_ED) ||
        (macScan.scanCnf.scanType == MAC_SCAN_PASSIVE))
    {
      /* if energy detect or passive scan start the scan immediately */
      MAP_macScanStartTimer(pEvent);
    }
#ifdef FEATURE_ENHANCED_BEACON
    else if ( (MAC_SCAN_ACTIVE == macScan.scanCnf.scanType ) && (MAC_MPM_SCAN_NBPAN == macScan.MPMScanType) )
    {
      /* allocate buffer */
      if ( (pMsg = MAP_macAllocTxBuffer(MAC_INTERNAL_COEXIST_EB_REQ, &macScan.sec)) != NULL )
      {
        /* build and enqueue Coexist enhanced beacon request */
        status = macBuildCoexistEBeaconReq(pMsg, &dstAddr, &macScan.sec);
        /* If the outgoing frame has security errors, then pass it up
         * to the upperlayer by first calling macScanComplete, which
         * in turn calls MAC_MLME_SCAN_CNF
         */
        if((status == MAC_COUNTER_ERROR) ||
           (status == MAC_FRAME_TOO_LONG) ||
           (status == MAC_UNAVAILABLE_KEY) ||
           (status == MAC_UNSUPPORTED_SECURITY) ||
           (status == MAC_INVALID_PARAMETER))
        {
          macScan.scanCnf.hdr.status = status;
          pEvent->hdr.event = MAC_INT_SCAN_COMPLETE_EVT;
          MAP_macExecute(pEvent);
        }
      }
    }
    else if (macScan.scanCnf.scanType == MAC_SCAN_ACTIVE_ENHANCED)
    {
      /* allocate buffer */
      if ((pMsg = MAP_macAllocTxBuffer(MAC_INTERNAL_ENHANCED_BEACON_REQ, &macScan.sec)) != NULL)
      {
        requestField  = ((macScan.permitJoining == TRUE) << 0);
        requestField |= ((macScan.linkQuality   > 0)     << 1);
        requestField |= ((macScan.percentFilter > 0)     << 2);
        status = macBuildEnhanceBeaconReq(pMsg, &dstAddr, &macScan.sec, requestField,
                                              macScan.linkQuality, macScan.percentFilter);

        /* If the outgoing frame has security errors, then pass it up
         * to the upperlayer by first calling macScanComplete, which
         * in turn calls MAC_MLME_SCAN_CNF
         */
        if((status == MAC_COUNTER_ERROR) ||
           (status == MAC_FRAME_TOO_LONG) ||
           (status == MAC_UNAVAILABLE_KEY) ||
           (status == MAC_UNSUPPORTED_SECURITY) ||
           (status == MAC_INVALID_PARAMETER))
        {
          macScan.scanCnf.hdr.status = status;
          pEvent->hdr.event = MAC_INT_SCAN_COMPLETE_EVT;
          MAP_macExecute(pEvent);
        }
      }
    }
#endif /* FEATURE_ENHANCED_BEACON */
    else
    {
      /* if orphan or active scan build an orphan notif. or beacon req */
      if (macScan.scanCnf.scanType == MAC_SCAN_ACTIVE)
      {
        cmd = MAC_INTERNAL_BEACON_REQ;
        srcAddrMode = SADDR_MODE_NONE | MAC_SRC_PAN_ID_BROADCAST;
      }
      else
      {
        cmd = MAC_INTERNAL_ORPHAN_NOTIF;
        srcAddrMode = SADDR_MODE_EXT | MAC_SRC_PAN_ID_BROADCAST;
      }

      status = MAP_macBuildCommonReq(cmd, srcAddrMode, &dstAddr, MAC_PAN_ID_BROADCAST, 0, &macScan.sec);
      /* If the outgoing frame has security errors, then pass it up to the
       * upperlayer by first calling macScanComplete, which in turn calls
       * MAC_MLME_SCAN_CNF
       */
      if((status == MAC_COUNTER_ERROR) ||
         (status == MAC_FRAME_TOO_LONG) ||
         (status == MAC_UNAVAILABLE_KEY) ||
         (status == MAC_UNSUPPORTED_SECURITY) ||
         (status == MAC_INVALID_PARAMETER))
      {
          macScan.scanCnf.hdr.status = status;
          pEvent->hdr.event = MAC_INT_SCAN_COMPLETE_EVT;
          MAP_macExecute(pEvent);
      }
    }
  }
  else
  {
    /* reached last channel, scan is complete */
    pEvent->hdr.event = MAC_INT_SCAN_COMPLETE_EVT;
    MAP_macExecute(pEvent);
  }
}
#endif

/**************************************************************************************************
 * @fn          macScanStartTimer
 *
 * @brief       This function marks the current channel as scanned and sets up the scan timer
 *              callback.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macScanStartTimer(macEvent_t *pEvent)
{
  uint32  timeout;

  (void)pEvent;  // Intentionally unreferenced parameter

  /* mark current channel as scanned */
  macScan.scanCnf.unscannedChannels[(macScan.currentChannel - MAC_CHAN_LOWEST) / 8]
    &= ~((uint8) 1 << ((macScan.currentChannel - MAC_CHAN_LOWEST) % 8));

  /* set timeout; different for orphan and other scans */
  if (macScan.scanCnf.scanType == MAC_SCAN_ORPHAN)
  {
    timeout = (uint32) pMacPib->responseWaitTime * MAC_A_BASE_SUPERFRAME_DURATION;
  }
  else
  {
    if ( MAC_MPM_SCAN_BPAN == macScan.MPMScanType )
    {
      timeout = ((uint32)1 << macScan.scanDuration) * MAC_A_BASE_SUPERFRAME_DURATION;
    }
    else if ( MAC_MPM_SCAN_NBPAN == macScan.MPMScanType )
    {
      timeout = macScan.scanDuration * MAC_A_BASE_SLOT_DURATION;
    }
    else
    {
      timeout = (((uint32) 1 << macScan.scanDuration) + 1) * MAC_A_BASE_SUPERFRAME_DURATION;
    }
  }

  MAP_macTimer(&macScan.scanTimer, timeout);
}

/**************************************************************************************************
 * @fn          macScanRxBeacon
 *
 * @brief       This function performs beacon processing during an active or passive scan
 *              procedure.  If macScan.maxResults is nonzero and there is room in the result
 *              list to store the result, store the PAN descriptor in the scan result list.  If
 *              no more results will fit in the result list, macExecute() is called to send a
 *              MAC_INT_SCAN_COMPLETE to the MAC.  If pMacPib->autoRequest is FALSE or if there is
 *              a beacon payload, function macBeaconNotifyInd() is called to send
 *              MAC_BEACON_NOTIFY_IND to the application.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macScanRxBeacon(macEvent_t *pEvent)
{
  macMlmeBeaconNotifyInd_t  notifyInd;
  macPanDesc_t              panDesc;
  macPanDesc_t              *pPanDesc;
  uint8                     i;

  DBG_PRINT0(DBGSYS, "Inside macScanRxBeacon");

  if ((macScan.scanCnf.scanType == MAC_SCAN_PASSIVE) ||
      (macScan.scanCnf.scanType == MAC_SCAN_ACTIVE)  ||
      (macScan.scanCnf.scanType == MAC_SCAN_ACTIVE_ENHANCED))
  {
#ifdef FEATURE_ENHANCED_BEACON
    /* Enhanced beacons are of frame version 2 */
    if ( macScan.MPMScanType &&
         (((pEvent->rx.internal.fcf & MAC_FCF_FRAME_VERSION_MASK) >> MAC_FCF_FRAME_VERSION_POS) == MAC_FRAME_VERSION_2) )
    {
      if ( pEvent->rx.payloadIePresent )
      {
        /* initialize */
        MAP_osal_memset( &notifyInd, 0x0, sizeof(macMlmeBeaconNotifyInd_t) );
        notifyInd.beaconType = MAC_BEACON_ENHANCED;

        MAP_osal_memset( &panDesc, 0x0, sizeof(macPanDesc_t) );
        notifyInd.info.eBeaconData.pPanDesc = &panDesc;

        /* build a beacon notify indication from beacon frame */
        if ( MAC_SUCCESS == macBuildEBeaconNotifyInd(&notifyInd, pEvent))
        {
          /**
           * send beacon notify only if we are able to
           * build one with coexistence IE data.
           */
          macScan.scanCnf.hdr.status = MAC_SUCCESS;

          DBG_PRINT0(DBGSYS, "Sending ebeacon notify");
          notifyInd.hdr.event = MAC_MLME_BEACON_NOTIFY_IND;
          MAP_MAC_CbackEvent((macCbackEvent_t *) &notifyInd);
        }
      }
    }
    else
#endif /* FEATURE_ENHANCED_BEACON */
    if ( !macScan.MPMScanType ) /* send normal beacon notify only for normal scan */
    {
      /* since we got a beacon, so far success */
      macScan.scanCnf.hdr.status = MAC_SUCCESS;

      /* initialize the data */
      MAP_osal_memset( &notifyInd, 0x0, sizeof(macMlmeBeaconNotifyInd_t) );

      /* build a beacon notify indication from beacon frame */
      notifyInd.info.beaconData.pPanDesc = &panDesc;
      MAP_macBuildBeaconNotifyInd(&notifyInd, pEvent);

      /* if we are storing results and there is room */
      if (macScan.scanCnf.resultListSize < macScan.maxResults)
      {
        /* Assume unique PAN */
        bool uniquePan = TRUE;

