nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_scan.c
        /* Check if it is unique against the list. If not, set to FALSE and break */
        pPanDesc = macScan.scanCnf.result.pPanDescriptor;
        for (i = macScan.scanCnf.resultListSize; i > 0; i--, pPanDesc++)
        {
          if ((pPanDesc->coordPanId == panDesc.coordPanId) &&
              MAP_sAddrCmp(&pPanDesc->coordAddress, &panDesc.coordAddress))
          {
            uniquePan = FALSE;
            break;
          }
        }

        /* if result is unique, add it */
        if (uniquePan)
        {
          /* store pan descriptor in scan results list */
          MAP_osal_memcpy(&macScan.scanCnf.result.pPanDescriptor[macScan.scanCnf.resultListSize],
                      &panDesc, sizeof(macPanDesc_t));
          macScan.scanCnf.resultListSize++;
        }
      }

      /* send beacon notify ind */
      if (pMacPib->autoRequest == FALSE || notifyInd.info.beaconData.sduLength > 0 || macScan.maxResults == 0)
      {
        MAP_MAC_CbackEvent((macCbackEvent_t *) &notifyInd);
      }
        /* if results list is full scan is complete */
      if ((macScan.maxResults != 0) &&
          (macScan.scanCnf.resultListSize == macScan.maxResults))
      {
        pEvent->hdr.event = MAC_INT_SCAN_COMPLETE_EVT;
        MAP_macExecute(pEvent);
      }
    }
  }
  else
  {
    /* Valid values for ScanType are passive, active or enhanced. If
     * scantype is invalid, then set status to MAC_INVALID_PARAMETER
     */
    macScan.scanCnf.hdr.status = MAC_INVALID_PARAMETER;
    pEvent->hdr.event = MAC_INT_SCAN_COMPLETE_EVT;
    MAP_macExecute(pEvent);
  }
}
#if !defined(TIMAC_ROM_PATCH)
/**************************************************************************************************
 * @fn          macScanRxCoordRealign
 *
 * @brief       This function handles a coordinator realignment received during an orphan scan.
 *              If the addressing mode of the frame is correct, it calls macProcessCoordRealign()
 *              to finish processing of the coordinator realignment.  The status value in
 *              macScan is set to MAC_SUCCESS, then macExecute() is called to send a
 *              MAC_INT_SCAN_COMPLETE to the MAC.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macScanRxCoordRealign(macEvent_t *pEvent)
{
  uint16  dat;
  uint8   *p;


  /* verify addressing mode is correct for orphan scan */
  if ((pEvent->rx.mac.srcAddr.addrMode != SADDR_MODE_EXT) ||
      (pEvent->rx.mac.dstAddr.addrMode != SADDR_MODE_EXT))
  {
    /* Addressing mode needs to be correct for orphan.
     * If not, set the status to MAC_INVALID_PARAM
     */
     macScan.scanCnf.hdr.status = MAC_INVALID_PARAMETER;
  }
  /* verify that stored extended address
   * from previous parent matches coordinator alignment attempt
   */
  else if (memcmp(pEvent->rx.mac.srcAddr.addr.extAddr,
             macPib.coordExtendedAddress.addr.extAddr, SADDR_EXT_LEN) != 0)
  {
      macScan.scanCnf.hdr.status = MAC_NO_BEACON;
  }
  /* addressing mode is correct for orphan scan and stored extended address
   * from previous parent matches coordinator alignment attempt
   */
  else {
    /* set coordinator extended address */
    MAP_MAC_MlmeSetReq(MAC_COORD_EXTENDED_ADDRESS, &pEvent->rx.mac.srcAddr);

#ifdef FEATURE_MAC_SECURITY
#if (defined TIMAC_ROM_IMAGE_BUILD)
    if (macPib.securityEnabled == TRUE)
    {
#endif

    /* set security PIB */
    MAP_MAC_MlmeSetSecurityReq(MAC_PAN_COORD_EXTENDED_ADDRESS, &pEvent->rx.mac.srcAddr);
#if (defined TIMAC_ROM_IMAGE_BUILD)
    }
#endif

#endif

    p = pEvent->rx.msdu.p;

    /* build and set the PAN ID */
    dat = BUILD_UINT16(p[0], p[1]);
    p += 2;
    MAP_MAC_MlmeSetReq(MAC_PAN_ID, &dat);

    /* build and set coordinator short address */
    dat = BUILD_UINT16(p[0], p[1]);
    p += 2;
    MAP_MAC_MlmeSetReq(MAC_COORD_SHORT_ADDRESS, &dat);

#ifdef FEATURE_MAC_SECURITY
#if (defined TIMAC_ROM_IMAGE_BUILD)
    if (macPib.securityEnabled == TRUE)
    {
#endif
    /* set security PIB */
    MAP_MAC_MlmeSetSecurityReq(MAC_PAN_COORD_SHORT_ADDRESS, &dat);
#if (defined TIMAC_ROM_IMAGE_BUILD)
    }
#endif
#endif

    /* set the channel */
    MAP_MAC_MlmeSetReq(MAC_LOGICAL_CHANNEL, p);
    p++;

    /* set our short address */
    dat = BUILD_UINT16(p[0], p[1]);
    MAP_MAC_MlmeSetReq(MAC_SHORT_ADDRESS, &dat);

    /* ignore channel page for now */

    /* orphan scan successful */
    macScan.scanCnf.hdr.status = MAC_SUCCESS;
  }

  /* scan complete */
  pEvent->hdr.event = MAC_INT_SCAN_COMPLETE_EVT;
  MAP_macExecute(pEvent);
}
#endif

/**************************************************************************************************
 * @fn          macScanComplete
 *
 * @brief       This function handles the completion of the scan procedure.  First the mac Timer is
 *              cancelled if it already running. The Radio scan is stoppedBeacon and RX disabled.
 *              The transmission is resumed by calling macExecute() to send a
 *              MAC_INT_BEACON_RESUME_EVT to the MAC.  Then macRadioStopScan() is called to restore
 *              the receiver settings after scan. If this is not a successful orphan scan then the
 *              channel is set to the original channel before the scan.  Finally, the MAC callback
 *              function is executed with event MAC_MLME_SCAN_CNF.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macScanComplete(macEvent_t *pEvent)
{
  (void)pEvent;  // Intentionally unreferenced parameter

  DBG_PRINT0(DBGSYS, "Inside macScanComplete");

  MAP_macTimerCancel(&macScan.scanTimer);
  MAP_macRadioStopScan();

  /* turn off receiver by clearing all scan flags */
  MAP_macRxSoftDisable(MAC_RX_SCAN);

  /* set channel, channel page and phy id back
     if not orphan or if orphan failed */
  if (!((macScan.scanCnf.scanType == MAC_SCAN_ORPHAN) &&
          (macScan.scanCnf.hdr.status == MAC_SUCCESS)))
  {
    MAP_MAC_MlmeSetReq(MAC_LOGICAL_CHANNEL, &macScan.origChannel);
    MAP_MAC_MlmeSetReq(MAC_CHANNEL_PAGE, &macScan.origChPage);

    if ( macScan.origPhyId != pMacPib->curPhyID )
    {
      MAP_MAC_MlmeSetReq(MAC_PHY_CURRENT_DESCRIPTOR_ID, &macScan.origPhyId);
    }
  }

  MAP_MAC_CbackEvent((macCbackEvent_t *) &macScan.scanCnf);
}

