nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/high_level/mac_scan.c
/**************************************************************************************************
 * @fn          macScanFailedInProgress
 *
 * @brief       This function calls the MAC callback with status MAC_SCAN_IN_PROGRESS.
 *
 * input parameters
 *
 * @param       pEvent - Pointer to event data.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
MAC_INTERNAL_API void macScanFailedInProgress(macEvent_t *pEvent)
{
  macMlmeScanCnf_t  scanCnf;

  DBG_PRINT0(DBGSYS, "Inside macScanFailedInProgress");

  MAP_macScanCnfInit(&scanCnf, pEvent);
  scanCnf.hdr.status = MAC_SCAN_IN_PROGRESS;
  MAP_MAC_CbackEvent((macCbackEvent_t *) &scanCnf);
}

/**************************************************************************************************
 * @fn          MAC_MlmeScanReq
 *
 * @brief       This function calls macSendMsg() to send an OSAL message containing a
 *              MAC_API_SCAN_REQ_EVT to the MAC.
 *
 * input parameters
 *
 * @param       pData - Pointer to parameters structure.
 *
 * output parameters
 *
 * None.
 *
 * @return      None.
 **************************************************************************************************
 */
ApiMac_status_t MAC_MlmeScanReq(ApiMac_mlmeScanReq_t *pData)
{
  ApiMac_status_t status = ApiMac_status_success;
  macMlmeScanReq_t scanReq;
  uint8* scanResults;

  if (MAP_macStateScanning())
  {
    status = ApiMac_status_scanInProgress;
    return status;
  }

  MAP_osal_memcpy(scanReq.scanChannels, pData->scanChannels,
         (MAC_154G_CHANNEL_BITMAP_SIZ));

  scanReq.scanType = (uint8)pData->scanType;
  scanReq.scanDuration = (uint8)pData->scanDuration;
  scanReq.channelPage = (uint8)pData->channelPage;
  scanReq.phyID = (uint8)pData->phyID;
  scanReq.maxResults = (uint8)pData->maxResults;
  scanReq.permitJoining = (bool)pData->permitJoining;
  scanReq.linkQuality = (uint8)pData->linkQuality;
  scanReq.percentFilter = (uint8)pData->percentFilter;

  scanReq.MPMScan = pData->MPMScan;
  scanReq.MPMScanType = (uint8)pData->MPMScanType;
  scanReq.MPMScanDuration = (uint16)pData->MPMScanDuration;

  MAP_osal_memcpy(&scanReq.sec, &pData->sec, sizeof(ApiMac_sec_t));

  if(pData->scanType == ApiMac_scantype_energyDetect)
  {
    scanResults = (void *)MAP_osal_mem_alloc(APIMAC_154G_MAX_NUM_CHANNEL);
    scanReq.result.pEnergyDetect = (uint8 *)scanResults;
    if (scanResults)
    {
      /* default to high value */
      MAP_osal_memset(scanResults, 0xFF, APIMAC_154G_MAX_NUM_CHANNEL);
    }
    else
    {
        status = ApiMac_status_noResources;
    }
  }
  else
  {
    scanReq.result.pPanDescriptor = NULL;
    if(scanReq.maxResults)
    {
      scanResults = (void *)MAP_osal_mem_alloc(
                    sizeof(macPanDesc_t) * scanReq.maxResults);
      scanReq.result.pPanDescriptor = (macPanDesc_t *)scanResults;
      if(scanResults == NULL)
      {
          status = ApiMac_status_noResources;
      }
    }
  }

  if(status == ApiMac_status_success)
  {
    MAP_macSendMsg(MAC_API_SCAN_REQ_EVT, &scanReq);
  }

  return status;
}
#endif /* (FEATURE_BEACON_MODE) || (FEATURE_NON_BEACON_MODE) */
